{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "git_diff",
      "type": "git-diff",
      "params": {
        "target": "main"
      }
    },
    {
      "id": "git_log",
      "type": "git-log",
      "params": {
        "limit": 10,
        "format": "oneline"
      }
    },
    {
      "id": "analyze_changes",
      "type": "claude-code",
      "params": {
        "task": "Analyze these git changes and commit history to understand what was implemented",
        "context": {
          "diff": "${git_diff.diff}",
          "commits": "${git_log.commits}"
        },
        "output_schema": {
          "summary": {
            "type": "str",
            "description": "One-line summary of changes"
          },
          "type_of_change": {
            "type": "str",
            "description": "Type: feature/bugfix/refactor/docs/test"
          },
          "components_affected": {
            "type": "list",
            "description": "List of components or modules affected"
          },
          "breaking_changes": {
            "type": "bool",
            "description": "Whether there are breaking changes"
          },
          "testing_suggestions": {
            "type": "list",
            "description": "Suggested test scenarios"
          }
        },
        "max_turns": 3
      }
    },
    {
      "id": "generate_pr",
      "type": "claude-code",
      "params": {
        "task": "Generate a comprehensive pull request description based on this analysis",
        "context": {
          "analysis": "${analyze_changes.result}",
          "diff_stats": "${git_diff.stats}"
        },
        "output_schema": {
          "title": {
            "type": "str",
            "description": "PR title following conventional commits"
          },
          "description": {
            "type": "str",
            "description": "Detailed PR description in markdown"
          },
          "checklist": {
            "type": "list",
            "description": "PR checklist items"
          }
        },
        "system_prompt": "You are a senior developer writing clear, professional PR descriptions. Use markdown formatting and be concise but thorough.",
        "max_turns": 2
      }
    },
    {
      "id": "save_pr",
      "type": "write-file",
      "params": {
        "path": ".github/pull_request_template.md",
        "content": "# ${generate_pr.result.title}\n\n${generate_pr.result.description}\n\n## Checklist\n${generate_pr.result.checklist}\n\n---\n**Type of change:** ${analyze_changes.result.type_of_change}\n**Breaking changes:** ${analyze_changes.result.breaking_changes}\n**Components affected:** ${analyze_changes.result.components_affected}\n\n## Testing\n${analyze_changes.result.testing_suggestions}"
      }
    },
    {
      "id": "cost_report",
      "type": "echo",
      "params": {
        "message": "\n\ud83d\udcca Workflow Cost Report:\n- Analysis: $${analyze_changes._claude_metadata.total_cost_usd} (${analyze_changes._claude_metadata.duration_ms}ms)\n- PR Generation: $${generate_pr._claude_metadata.total_cost_usd} (${generate_pr._claude_metadata.duration_ms}ms)\n- Total Cost: ~$${analyze_changes._claude_metadata.total_cost_usd + generate_pr._claude_metadata.total_cost_usd}\n- Total Turns Used: ${analyze_changes._claude_metadata.num_turns + generate_pr._claude_metadata.num_turns}"
      }
    }
  ],
  "edges": [
    {
      "from": "git_diff",
      "to": "analyze_changes"
    },
    {
      "from": "git_log",
      "to": "analyze_changes"
    },
    {
      "from": "analyze_changes",
      "to": "generate_pr"
    },
    {
      "from": "generate_pr",
      "to": "save_pr"
    },
    {
      "from": "save_pr",
      "to": "cost_report"
    }
  ]
}
