{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "analyze_error",
      "type": "claude-code",
      "params": {
        "task": "Analyze this error and provide debugging assistance:\n\nError message:\n${input.error_message}\n\nCode context (if available):\n${input.code_context}\n\nStack trace (if available):\n${input.stack_trace}",
        "output_schema": {
          "error_type": {
            "type": "str",
            "description": "Type of error (syntax/runtime/logic/configuration)"
          },
          "root_cause": {
            "type": "str",
            "description": "Root cause analysis"
          },
          "immediate_fix": {
            "type": "str",
            "description": "Quick fix to resolve the error"
          },
          "long_term_solution": {
            "type": "str",
            "description": "Better long-term solution"
          },
          "prevention_tips": {
            "type": "list",
            "description": "Tips to prevent similar errors"
          },
          "code_snippet": {
            "type": "str",
            "description": "Fixed code snippet if applicable"
          },
          "confidence": {
            "type": "int",
            "description": "Confidence level in the solution (1-10)"
          }
        },
        "max_turns": 2,
        "system_prompt": "You are an expert debugger. Be concise but thorough. Focus on practical solutions."
      }
    },
    {
      "id": "format_report",
      "type": "echo",
      "params": {
        "message": "\ud83d\udd0d DEBUG ANALYSIS REPORT\n========================\n\n**Error Type:** ${analyze_error.result.error_type}\n**Confidence:** ${analyze_error.result.confidence}/10\n\n## Root Cause\n${analyze_error.result.root_cause}\n\n## Immediate Fix\n${analyze_error.result.immediate_fix}\n\n## Code Fix\n```\n${analyze_error.result.code_snippet}\n```\n\n## Long-term Solution\n${analyze_error.result.long_term_solution}\n\n## Prevention Tips\n${analyze_error.result.prevention_tips}\n\n---\nAnalysis cost: $${analyze_error._claude_metadata.total_cost_usd}"
      }
    }
  ],
  "edges": [
    {
      "from": "analyze_error",
      "to": "format_report"
    }
  ],
  "inputs": {
    "error_message": {
      "type": "string",
      "description": "The error message to analyze",
      "required": true
    },
    "code_context": {
      "type": "string",
      "description": "Relevant code around the error",
      "required": false,
      "default": ""
    },
    "stack_trace": {
      "type": "string",
      "description": "Full stack trace if available",
      "required": false,
      "default": ""
    }
  }
}
