{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "read_code",
      "type": "read-file",
      "params": {
        "path": "${input.file_path}"
      }
    },
    {
      "id": "review",
      "type": "claude-code",
      "params": {
        "task": "Review this Python code for quality, security issues, and best practices:\n\n${read_code.content}",
        "output_schema": {
          "overall_quality": {
            "type": "str",
            "description": "Overall quality assessment: excellent/good/fair/poor"
          },
          "security_score": {
            "type": "int",
            "description": "Security score from 1-10 (10 being most secure)"
          },
          "issues": {
            "type": "list",
            "description": "List of specific issues found"
          },
          "improvements": {
            "type": "list",
            "description": "List of recommended improvements"
          },
          "has_critical_issues": {
            "type": "bool",
            "description": "Whether there are critical issues that must be fixed"
          },
          "refactored_code": {
            "type": "str",
            "description": "Improved version of the code with issues fixed"
          }
        },
        "max_turns": 2
      }
    },
    {
      "id": "save_review",
      "type": "write-file",
      "params": {
        "path": "${input.file_path}.review.md",
        "content": "# Code Review Report\n\n**File:** ${input.file_path}\n**Date:** $(date)\n\n## Overall Assessment\n- **Quality:** ${review.result.overall_quality}\n- **Security Score:** ${review.result.security_score}/10\n- **Critical Issues:** ${review.result.has_critical_issues}\n\n## Issues Found\n${review.result.issues}\n\n## Recommended Improvements\n${review.result.improvements}\n\n## Refactored Code\n```python\n${review.result.refactored_code}\n```\n\n---\n*Review cost: $${review._claude_metadata.total_cost_usd}*"
      }
    },
    {
      "id": "save_improved",
      "type": "write-file",
      "params": {
        "path": "${input.file_path}.improved.py",
        "content": "${review.result.refactored_code}"
      }
    }
  ],
  "edges": [
    {
      "from": "read_code",
      "to": "review"
    },
    {
      "from": "review",
      "to": "save_review"
    },
    {
      "from": "review",
      "to": "save_improved"
    }
  ],
  "inputs": {
    "file_path": {
      "type": "string",
      "description": "Path to the Python file to review",
      "required": true
    }
  }
}
