{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "generate",
      "type": "claude-code",
      "params": {
        "task": "Write a Python function that calculates the nth Fibonacci number using dynamic programming. Include proper error handling, type hints, and a docstring explaining the algorithm.",
        "max_turns": 1
      }
    },
    {
      "id": "save",
      "type": "write-file",
      "params": {
        "path": "fibonacci.py",
        "content": "${generate.result}"
      }
    },
    {
      "id": "report",
      "type": "echo",
      "params": {
        "message": "\u2705 Code generated and saved to fibonacci.py\n\nExecution cost: $${generate._claude_metadata.total_cost_usd}\nDuration: ${generate._claude_metadata.duration_ms}ms\nTokens used: ${generate._claude_metadata.usage.input_tokens} input, ${generate._claude_metadata.usage.output_tokens} output"
      }
    }
  ],
  "edges": [
    {
      "from": "generate",
      "to": "save"
    },
    {
      "from": "save",
      "to": "report"
    }
  ]
}
