{
  "ir_version": "1.0.0",
  "nodes": [
    {
      "id": "echo_test",
      "type": "mcp-test-http-echo",
      "params": {
        "message": "HTTP transport is amazing!"
      }
    },
    {
      "id": "time_test",
      "type": "mcp-test-http-get_time",
      "params": {}
    },
    {
      "id": "math_test",
      "type": "mcp-test-http-add_numbers",
      "params": {
        "a": 10,
        "b": 32
      }
    }
  ],
  "edges": []
}
