{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "show_missing_input",
      "type": "workflow",
      "params": {
        "workflow_ref": "examples/interfaces/text_analyzer.json",
        "param_mapping": {
          "language": "en"
        },
        "comment": "This should fail because 'text' is required but not provided"
      }
    }
  ],
  "edges": []
}
