{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "analyze",
      "type": "workflow",
      "params": {
        "workflow_ref": "examples/interfaces/text_analyzer.json",
        "param_mapping": {
          "text": "$stdin",
          "language": "en",
          "max_length": 100
        }
      }
    }
  ],
  "edges": []
}
