{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "setup",
      "type": "test",
      "params": {
        "data": {
          "comment": "This workflow intentionally omits the required 'text' parameter to demonstrate validation"
        }
      }
    },
    {
      "id": "analyze",
      "type": "workflow",
      "params": {
        "workflow_ref": "examples/interfaces/text_analyzer.json",
        "param_mapping": {
          "language": "en"
        },
        "comment": "Missing required 'text' parameter - should fail with helpful error"
      }
    }
  ],
  "edges": [
    {
      "from": "setup",
      "to": "analyze"
    }
  ]
}
