{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "create_test_file",
      "type": "write-file",
      "params": {
        "file_path": "test_input.txt",
        "content": "This is a test file with some content to analyze. It contains multiple sentences and demonstrates the workflow composition feature."
      }
    },
    {
      "id": "run_composition",
      "type": "workflow",
      "params": {
        "workflow_ref": "examples/interfaces/workflow_composition.json",
        "param_mapping": {
          "file_path": "test_input.txt",
          "output_file": "analysis_output.txt"
        }
      }
    }
  ],
  "edges": [
    {
      "from": "create_test_file",
      "to": "run_composition"
    }
  ]
}
