{
  "ir_version": "0.1.0",
  "inputs": {
    "message": {
      "description": "Message to write to file",
      "required": true,
      "type": "string"
    },
    "filename": {
      "description": "Output filename",
      "required": false,
      "type": "string",
      "default": "output.txt"
    }
  },
  "outputs": {
    "success": {
      "description": "Whether the file was written successfully",
      "type": "boolean"
    }
  },
  "nodes": [
    {
      "id": "writer",
      "type": "write-file",
      "params": {
        "file_path": "${filename}",
        "content": "${message}"
      }
    }
  ],
  "edges": []
}
