{
  "ir_version": "0.1.0",
  "metadata": {
    "description": "Demonstrates storage isolation modes with nested workflows"
  },
  "nodes": [
    {
      "id": "prepare_data",
      "type": "pflow.nodes.test_node",
      "params": {
        "sensitive_data": "SECRET_KEY_123",
        "public_data": "This is public"
      }
    },
    {
      "id": "isolated_process",
      "type": "workflow",
      "params": {
        "workflow_ir": {
          "ir_version": "0.1.0",
          "nodes": [
            {
              "id": "process",
              "type": "pflow.nodes.test_node",
              "params": {
                "operation": "process_isolated"
              }
            }
          ],
          "edges": []
        },
        "storage_mode": "isolated",
        "param_mapping": {
          "safe_input": "${public_data}"
        },
        "output_mapping": {
          "result": "isolated_result"
        }
      }
    },
    {
      "id": "scoped_process",
      "type": "workflow",
      "params": {
        "workflow_ref": "./process-text.json",
        "storage_mode": "scoped",
        "scope_prefix": "child_",
        "param_mapping": {
          "text": "${child_data}"
        },
        "error_action": "handle_error"
      }
    }
  ],
  "edges": [
    {
      "from": "prepare_data",
      "to": "isolated_process"
    },
    {
      "from": "isolated_process",
      "to": "scoped_process",
      "action": "default"
    }
  ]
}
