{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "fetch_users",
      "type": "http",
      "purpose": "Fetch a list of users from JSONPlaceholder API",
      "params": {
        "url": "https://jsonplaceholder.typicode.com/users",
        "method": "GET"
      }
    },
    {
      "id": "greet_users",
      "type": "shell",
      "purpose": "Greet each user by name (parallel)",
      "batch": {
        "items": "${fetch_users.response}",
        "as": "user",
        "parallel": true,
        "max_concurrent": 5
      },
      "params": {
        "command": "echo \"Hello, ${user.name}!\""
      }
    }
  ],
  "edges": [
    {
      "from": "fetch_users",
      "to": "greet_users"
    }
  ]
}
