{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "read-config",
      "type": "mcp-filesystem-read_text_file",
      "params": {
        "path": "/tmp/config.json"
      }
    },
    {
      "id": "parse-json",
      "type": "llm",
      "params": {
        "prompt": "Extract the important settings from this JSON config: ${read-config.result}"
      }
    }
  ],
  "edges": [
    {
      "from": "read-config",
      "to": "parse-json"
    }
  ]
}
