{
  "ir_version": "0.1.0",
  "inputs": {
    "topic": {
      "description": "Topic to write about",
      "type": "string",
      "required": true
    },
    "style": {
      "description": "Writing style",
      "type": "string",
      "required": false,
      "default": "professional"
    },
    "max_words": {
      "description": "Maximum word count",
      "type": "number",
      "required": false,
      "default": 50
    }
  },
  "outputs": {
    "response": {
      "description": "The LLM's response",
      "type": "string"
    },
    "llm_usage": {
      "description": "Token usage information",
      "type": "object"
    }
  },
  "nodes": [
    {
      "id": "generate",
      "type": "llm",
      "params": {
        "prompt": "Write a ${style} explanation about ${topic} in exactly ${max_words} words. Be concise and clear.",
        "model": "claude-3.5-haiku",
        "temperature": 0.7,
        "max_tokens": 200
      }
    }
  ],
  "edges": []
}
