{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "fetch_data",
      "type": "http-get",
      "params": {
        "url": "https://api.example.com/data",
        "timeout": 30
      }
    },
    {
      "id": "process_data",
      "type": "json-transform",
      "params": {
        "schema": "data_schema_v1"
      }
    },
    {
      "id": "save_result",
      "type": "database-insert",
      "params": {
        "table": "processed_data"
      }
    },
    {
      "id": "handle_error",
      "type": "error-logger",
      "params": {
        "severity": "error",
        "notify": true
      }
    },
    {
      "id": "retry_fetch",
      "type": "http-get",
      "params": {
        "url": "https://api.example.com/data",
        "timeout": 60,
        "retry_count": "$retry_count"
      }
    }
  ],
  "edges": [
    {
      "from": "fetch_data",
      "to": "process_data"
    },
    {
      "from": "fetch_data",
      "to": "handle_error",
      "action": "error"
    },
    {
      "from": "process_data",
      "to": "save_result"
    },
    {
      "from": "process_data",
      "to": "handle_error",
      "action": "error"
    },
    {
      "from": "handle_error",
      "to": "retry_fetch",
      "action": "retry"
    },
    {
      "from": "retry_fetch",
      "to": "process_data"
    },
    {
      "from": "save_result",
      "to": "handle_error",
      "action": "error"
    }
  ]
}
