{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "read_source",
      "type": "read-file",
      "params": {
        "file_path": "data/input.txt"
      }
    },
    {
      "id": "process_file",
      "type": "test",
      "params": {}
    },
    {
      "id": "save_result",
      "type": "write-file",
      "params": {
        "file_path": "output/result.txt"
      }
    },
    {
      "id": "log_error",
      "type": "write-file",
      "params": {
        "file_path": "logs/error.log",
        "append": true
      }
    },
    {
      "id": "create_fallback",
      "type": "write-file",
      "params": {
        "file_path": "output/fallback.txt",
        "content": "Processing failed - using default content"
      }
    },
    {
      "id": "retry_processor",
      "type": "test-retry",
      "params": {
        "max_attempts": 3
      }
    }
  ],
  "edges": [
    {
      "from": "read_source",
      "to": "process_file"
    },
    {
      "from": "read_source",
      "to": "log_error",
      "action": "error"
    },
    {
      "from": "process_file",
      "to": "save_result"
    },
    {
      "from": "process_file",
      "to": "log_error",
      "action": "error"
    },
    {
      "from": "save_result",
      "to": "log_error",
      "action": "error"
    },
    {
      "from": "log_error",
      "to": "create_fallback"
    },
    {
      "from": "process_file",
      "to": "retry_processor",
      "action": "retry"
    },
    {
      "from": "retry_processor",
      "to": "process_file"
    }
  ]
}
