{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "hello",
      "type": "write-file",
      "params": {
        "content": "Hello, pflow!",
        "file_path": "hello.txt"
      }
    }
  ]
}
