{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "reader",
      "type": "read-file",
      "params": {
        "file_path": "input.txt"
      }
    },
    {
      "id": "test_processor",
      "type": "test",
      "params": {}
    },
    {
      "id": "writer",
      "type": "write-file",
      "params": {
        "file_path": "output.txt"
      }
    }
  ],
  "edges": [
    {
      "from": "reader",
      "to": "test_processor"
    },
    {
      "from": "test_processor",
      "to": "writer"
    }
  ],
  "mappings": {
    "test_processor": {
      "input_mappings": {
        "test_input": "content"
      },
      "output_mappings": {
        "test_output": "processed_content"
      }
    },
    "writer": {
      "input_mappings": {
        "content": "processed_content"
      }
    }
  }
}
