{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "reader",
      "type": "read-file",
      "params": {
        "file_path": "input.txt"
      }
    },
    {
      "id": "copier",
      "type": "copy-file",
      "params": {
        "destination": "backup.txt"
      }
    },
    {
      "id": "writer",
      "type": "write-file",
      "params": {
        "file_path": "output.txt"
      }
    }
  ],
  "edges": [
    {
      "from": "reader",
      "to": "copier"
    },
    {
      "from": "copier",
      "to": "writer"
    }
  ]
}
