{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "reader",
      "type": "read-file",
      "params": {
        "file_path": "$input_file",
        "encoding": "$file_encoding"
      }
    },
    {
      "id": "copier",
      "type": "copy-file",
      "params": {
        "source": "$input_file",
        "destination": "$backup_dir/$backup_name"
      }
    },
    {
      "id": "writer",
      "type": "write-file",
      "params": {
        "file_path": "$output_dir/$output_file",
        "content": "Processed on: $timestamp\nOriginal file: $input_file\n\n$file_content"
      }
    }
  ],
  "edges": [
    {
      "from": "reader",
      "to": "copier"
    },
    {
      "from": "copier",
      "to": "writer"
    }
  ]
}
