{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "reader",
      "type": "read-file",
      "params": {
        "file_path": "$input_file",
        "encoding": "$file_encoding"
      }
    },
    {
      "id": "api_caller",
      "type": "test",
      "params": {
        "endpoint": "$api_endpoint",
        "auth_token": "$api_token"
      }
    },
    {
      "id": "copier",
      "type": "copy-file",
      "params": {
        "source": "$input_file",
        "destination": "$backup_dir/$backup_name"
      }
    },
    {
      "id": "writer",
      "type": "write-file",
      "params": {
        "file_path": "$output_dir/$output_file",
        "content": "Processed on: $timestamp\nOriginal file: $input_file\n\n$file_content"
      }
    },
    {
      "id": "notifier",
      "type": "test",
      "params": {
        "recipient": "$recipient_email",
        "subject": "Process completed for $input_file"
      }
    }
  ],
  "edges": [
    {
      "from": "reader",
      "to": "api_caller"
    },
    {
      "from": "api_caller",
      "to": "copier"
    },
    {
      "from": "copier",
      "to": "writer"
    },
    {
      "from": "writer",
      "to": "notifier"
    }
  ]
}
