{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "research",
      "type": "web-search",
      "params": {
        "query": "$topic advanced guide tutorial",
        "limit": 10,
        "domains": [
          "docs.python.org",
          "realpython.com",
          "stackoverflow.com"
        ]
      }
    },
    {
      "id": "outline",
      "type": "llm-outliner",
      "params": {
        "prompt": "Create a comprehensive tutorial outline for: $topic\n\nTarget audience: $audience\nDifficulty: $difficulty\n\nResearch findings:\n$research_summary",
        "model": "gpt-4",
        "format": "markdown"
      }
    },
    {
      "id": "expand_sections",
      "type": "llm-writer",
      "params": {
        "prompt": "Expand each section of this outline into detailed content:\n\n$outline\n\nStyle: $writing_style\nInclude: code examples, best practices, common pitfalls",
        "model": "gpt-4",
        "max_tokens": 4000
      }
    },
    {
      "id": "add_examples",
      "type": "code-generator",
      "params": {
        "language": "$programming_language",
        "concepts": "$key_concepts",
        "style": "educational"
      }
    },
    {
      "id": "review_technical",
      "type": "llm-reviewer",
      "params": {
        "prompt": "Review this technical content for accuracy:\n\n$full_content\n\nCheck for:\n- Technical accuracy\n- Code correctness\n- Best practices\n- Security issues",
        "model": "gpt-4",
        "temperature": 0.3
      }
    },
    {
      "id": "format_output",
      "type": "markdown-formatter",
      "params": {
        "template": "tutorial",
        "add_toc": true,
        "syntax_highlight": true,
        "metadata": {
          "title": "$topic Tutorial",
          "author": "$author",
          "date": "$date",
          "tags": "$tags"
        }
      }
    },
    {
      "id": "save_draft",
      "type": "file-writer",
      "params": {
        "path": "drafts/$topic-tutorial-draft.md",
        "backup": true
      }
    }
  ],
  "edges": [
    {
      "from": "research",
      "to": "outline"
    },
    {
      "from": "outline",
      "to": "expand_sections"
    },
    {
      "from": "expand_sections",
      "to": "add_examples"
    },
    {
      "from": "add_examples",
      "to": "review_technical"
    },
    {
      "from": "review_technical",
      "to": "format_output"
    },
    {
      "from": "review_technical",
      "to": "expand_sections",
      "action": "needs_revision"
    },
    {
      "from": "format_output",
      "to": "save_draft"
    }
  ]
}
