{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "read_source",
      "type": "read-file",
      "params": {
        "file_path": "$source_dir/$source_file"
      }
    },
    {
      "id": "backup_original",
      "type": "copy-file",
      "params": {
        "source": "$source_dir/$source_file",
        "destination": "backups/$timestamp_$source_file"
      }
    },
    {
      "id": "process_content",
      "type": "test",
      "params": {}
    },
    {
      "id": "validate_result",
      "type": "test-structured",
      "params": {}
    },
    {
      "id": "save_processed",
      "type": "write-file",
      "params": {
        "file_path": "processed/$output_file"
      }
    },
    {
      "id": "save_validation_report",
      "type": "write-file",
      "params": {
        "file_path": "reports/validation_$timestamp.txt"
      }
    },
    {
      "id": "retry_processing",
      "type": "test-retry",
      "params": {}
    },
    {
      "id": "archive_results",
      "type": "move-file",
      "params": {
        "source": "processed/$output_file",
        "destination": "archive/$date/$output_file"
      }
    }
  ],
  "edges": [
    {
      "from": "read_source",
      "to": "backup_original"
    },
    {
      "from": "backup_original",
      "to": "process_content"
    },
    {
      "from": "process_content",
      "to": "validate_result"
    },
    {
      "from": "validate_result",
      "to": "save_processed"
    },
    {
      "from": "validate_result",
      "to": "retry_processing",
      "action": "needs_revision"
    },
    {
      "from": "retry_processing",
      "to": "validate_result"
    },
    {
      "from": "save_processed",
      "to": "save_validation_report"
    },
    {
      "from": "save_validation_report",
      "to": "archive_results"
    }
  ]
}
