{
  "ir_version": "0.1.0",
  "nodes": [
    {
      "id": "fetch_issue",
      "type": "github-api",
      "params": {
        "endpoint": "/repos/$repo_owner/$repo_name/issues/$issue_number",
        "method": "GET"
      }
    },
    {
      "id": "analyze_issue",
      "type": "llm-analyzer",
      "params": {
        "prompt": "Analyze this GitHub issue and suggest: 1) Root cause 2) Potential fix 3) Affected files\n\nIssue title: $issue_title\nIssue body: $issue_body\nLabels: $issue_labels",
        "model": "gpt-4",
        "max_tokens": 1000
      }
    },
    {
      "id": "search_codebase",
      "type": "code-search",
      "params": {
        "query": "$suggested_search_terms",
        "file_types": [
          ".py",
          ".js",
          ".ts"
        ],
        "limit": 20
      }
    },
    {
      "id": "generate_patch",
      "type": "llm-coder",
      "params": {
        "prompt": "Based on the issue analysis and relevant code, generate a fix:\n\nIssue: $issue_summary\nSuggested approach: $suggested_fix\nRelevant code:\n$relevant_code",
        "model": "gpt-4",
        "temperature": 0.2
      }
    },
    {
      "id": "create_pr",
      "type": "github-api",
      "params": {
        "endpoint": "/repos/$repo_owner/$repo_name/pulls",
        "method": "POST",
        "body": {
          "title": "Fix: $issue_title",
          "body": "Fixes #$issue_number\n\n## Analysis\n$issue_analysis\n\n## Changes\n$change_summary",
          "head": "$branch_name",
          "base": "main"
        }
      }
    },
    {
      "id": "comment_error",
      "type": "github-api",
      "params": {
        "endpoint": "/repos/$repo_owner/$repo_name/issues/$issue_number/comments",
        "method": "POST",
        "body": {
          "body": "I encountered an error while attempting to fix this issue:\n\n```\n$error_message\n```\n\nPlease review the issue description and try again."
        }
      }
    }
  ],
  "edges": [
    {
      "from": "fetch_issue",
      "to": "analyze_issue"
    },
    {
      "from": "analyze_issue",
      "to": "search_codebase"
    },
    {
      "from": "search_codebase",
      "to": "generate_patch"
    },
    {
      "from": "generate_patch",
      "to": "create_pr"
    },
    {
      "from": "fetch_issue",
      "to": "comment_error",
      "action": "error"
    },
    {
      "from": "analyze_issue",
      "to": "comment_error",
      "action": "error"
    },
    {
      "from": "generate_patch",
      "to": "comment_error",
      "action": "error"
    }
  ]
}
